HDDS-14479. refine chart with marmaid
